{"word_index": {"<OOV>": 1, "var": 2, "och": 3, "en": 4, "f\u00f6r": 5, "k\u00e4ndes": 6, "helt": 7, "som": 8, "att": 9, "jag": 10, "av": 11, "otroligt": 12, "ett": 13, "filmen": 14, "ganska": 15, "inget": 16, "mig": 17, "den": 18, "om": 19, "varken": 20, "bra": 21, "eller": 22, "mest": 23, "okej": 24, "fantastiskt": 25, "riktigt": 26, "l\u00e5ng": 27, "sk\u00e5despelarna": 28, "gjorde": 29, "n\u00e4stan": 30, "det": 31, "se": 32, "dem": 33, "scenerna": 34, "d\u00e5liga": 35, "m\u00e4ktig": 36, "helhet": 37, "verkligen": 38, "l\u00e4mnade": 39, "avtryck": 40, "vilket": 41, "djupt": 42, "ber\u00f6rande": 43, "slut": 44, "p\u00e5": 45, "slutet": 46, "intets\u00e4gande": 47, "gav": 48, "extra": 49, "manuset": 50, "skrivet": 51, "fotot": 52, "vackert": 53, "handlingen": 54, "fjantig": 55, "alldeles": 56, "on\u00f6digt": 57, "r\u00f6rig": 58, "id\u00e9": 59, "aldrig": 60, "lyfte": 61, "dialogen": 62, "tight": 63, "jobb": 64, "st\u00e4mningen": 65, "besviken": 66, "platt": 67, "musiken": 68, "smart": 69, "vald": 70, "passade": 71, "underbart": 72, "till": 73, "bilderna": 74, "seg": 75, "ta": 76, "sig": 77, "igenom": 78, "tempot": 79, "lagom": 80, "snabbt": 81, "l\u00e5ngsamt": 82, "somnade": 83, "s\u00e5": 84, "tr\u00e5kig": 85, "ny": 86, "niv\u00e5": 87, "filmskapande": 88, "\u00e4r": 89, "stum": 90, "beundran": 91, "rulle": 92, "regnig": 93, "s\u00f6ndag": 94, "men": 95, "mer": 96, "karakt\u00e4rerna": 97, "platta": 98, "brydde": 99, "inte": 100, "vilken": 101, "kemi": 102, "mellan": 103, "slog": 104, "gnistor": 105, "effekterna": 106, "bedr\u00f6vliga": 107, "s\u00e5g": 108, "ut": 109, "datorspel": 110, "klart": 111, "\u00e5rets": 112, "b\u00e4sta": 113, "filmupplevelser": 114, "lite": 115, "v\u00e4l": 116, "pretenti\u00f6s": 117, "min": 118, "smak": 119, "faktiskt": 120, "mysig": 121, "film": 122, "man": 123, "blir": 124, "glad": 125, "kommer": 126, "minnas": 127, "vecka": 128, "blek": 129}, "max_length": 20, "padding_type": "post", "trunc_type": "post", "labels": ["negativ", "neutral", "positiv"], "oov_token": "<OOV>"}
{"format": "layers-model", "generatedBy": "keras v2.19.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "modelTopology": {"keras_version": "2.19.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 20], "dtype": "float32", "sparse": false, "ragged": false, "name": "embedding_input"}}, {"class_name": "Embedding", "config": {"name": "embedding", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 20], "input_dim": 1000, "output_dim": 16, "embeddings_initializer": {"module": "keras.initializers", "class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "registered_name": null}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 20}}, {"class_name": "GlobalAveragePooling1D", "config": {"name": "global_average_pooling1d", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 24, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 3, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Custom>Adam", "config": {"name": "Adam", "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "jit_compile": false, "is_legacy_optimizer": false, "learning_rate": 0.0010000000474974513, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "dense/kernel", "shape": [16, 24], "dtype": "float32"}, {"name": "dense/bias", "shape": [24], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [24, 3], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [3], "dtype": "float32"}, {"name": "embedding/embeddings", "shape": [1000, 16], "dtype": "float32"}]}]}
